{
  "name": "Elven",
  "description": "",
  "author": "Wald Habets",
  "lineages": [
    {
      "name": "Hisan",
      "description": "***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Finesse, Wijsheid of Charisma.\n\n***Snelheid.*** 30ft\n\n***Draagcapaciteit.*** Medium\n\n***Gewichtsklasse.*** Medium\n\n***Aangeboren Talent.***  \nJe kan niet gecharmeerd worden. Eén keer per dag, als je faalt op een Wijsheid of Charisma reddingsworp, kun je kiezen om te slagen.\n\n***Aangeboren Talent.*** Je kunt één levend, intelligent wezen aanraken, en proberen één herinnering uit hun geest te lezen. Indien het wezen slaapt, slaagt de poging automatisch, anders maakt het doelwit een Wijsheidsreddingsworp tegen een DC van `8 + PB + Charisma Bonus`. Indien het wezen slaagt met 5 of meer, dan heeft deze door dat je probeerde in te dringen in zijn geest. Het wezen is immuun tegen verdere indringen voor 24 uur, ongeacht of hij faalt of succesvol is. Je kan deze vaardigheid een maximaal aantal keer per dag gebruiken gelijk aan je charisma bonus.\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen."
    },
    {
      "name": "Rosan",
      "description": "In de volksmond worden ze vaak benoemd als lage elf. Een toepasselijke naam voor het kleine schepsel, dat gewoonlijk niet veel langer is als 90cm. De Rosan tunnelt door weelderige heuvels of bouwt hutten in de toppen van bomen. Het is een volk dat zich verzameld in kleine gemeenschappen. Ze leven in rustige, afgezonderde dorpen en genieten van de kleine dingen in het leven.\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Finesse, Wijsheid of Charisma.\n\n***Snelheid.*** 7.5m (25ft)\n\n***Draagcapaciteit.*** Small\n\n***Gewichtsklasse.*** Small\n\n***Aangeboren Talent.*** Je kan een bericht met de wind meegeven dat niet langer dan 24 woorden is. Je kiest een ontvanger en locatie waar het bericht geleverd moet worden. Je bericht is een uur onderweg voor elke 20 kilometer die het aflegt, maar de afstand is onbeperkt. Indien de ontvanger aanwezig is op de locatie, kan deze een Perceptieworp maken met een DC 15 om het bericht te horen. Je kan dit hoogstens één maal per dag doen.\n\n***Aangeboren Talent.*** Je kan één levenssteen opofferen om een deel van je geest uit te ademen en een klein (Tiny) dier binnen 1.5m (5ft) van je te bezitten. Het bezeten dier wordt vriendelijk tegenover jou en volgt je commando's, zolang ze uit ongeveer 3 of minder stappen bestaan. Als het dier sterft terwijl het bezeten is, rol de levenssteen: je ontvangt het resultaat als psychische schade. Het maximum aantal dieren dat je op deze manier kan bezitten is gelijk aan je charisma bonus. Voor elk dier dat je bezit, reduceer je maximale aantal levensstenen met één. Je krijgt de steen pas terug als de bezitting is opgeheven.\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen."
    }
  ]
}