{
  "name": "Elven",
  "description": "De meeste elven leven in teruggetrokken enclaves. Ze voelen niet veel voor de industriële vooruitgang van de urr. In plaats hiervan beoefenen ze een conservatieve levensstijl en houden vast aan oeroude rituelen en tradities. De meeste elvenenclaves bevinden zich in de diepe wildernis, ver van andere beschavingen. Als gevolg zijn deze wezens vaak wereldvreemd en achterdochtig ten opzichten van buitenstaanders.\n\nElven hebben, in tegenstelling tot andere bloedlijnen, een unieke diepe connectie met de kosmos. Dit vertaald zich meestal in een sterke geest en liefde voor het natuurlijke. Druïden worden dan ook vaker geboren onder de elvengemeenschappen als bij de urran.\n\nDe uitgestrekte wildernis van Ittilia zorgt ervoor dat elven meestal in vrede binnen de grenzen van de urr-rijken kunnen leven. Desondanks beseffen de enclaves dat dit vaak onder de gratie van de huidige urr leiders is. Vele elvenenclaves nemen hierom extra stappen om onder de radar te blijven. Hun thuislanden zijn verhuld en de omliggende gebieden betoverd om indringers te misleiden en af te schrikken. Hieruit groeien vaak mythes dat de elven een bloeddorstig volk zijn en het best ontweken worden. Deze zijn vaak veelvoorkomend in kleinere dorpen of steden en landelijke gebieden. Soms zijn ze waar, andere keer weer niet.\n\nEen klein aantel elven breekt vrij van de oude tradities en gesloten enclaves en voegt zich bij de urr gemeenschappen. Hoewel ze hier soms te kampen hebben met vooroordelen, gedijen ze over het algemeen beter als in hun oude huizen. Ze genieten van de vrijheid die ze niet hebben binnen een strikte elven gemeenschap. Hun diepere connectie met de kosmos is vaak een voordeel binnen academische gemeenschappen.",
  "author": "Wald Habets",
  "lineages": [
    {
      "name": "Hisan",
      "description": "De hisan vinden zichzelf vaak elegant, hoewel andere bloedlijnen dit woord gewoonlijk vervangen door arrogant. Hisanan kennen gewoonlijk een striktere en meer elitaire cultuur dan de rosan. In tegenstelling tot deze laatste bouwen hisanan hun huizen op een meer traditionele wijze uit steen en hout.\n\n## Uiterlijk\n\nDe Hisan deelt veel uiterlijke kenmerken met de Rosan. Het meest opvallende is de huid. Deze heeft een bladachtige textuur, alsof het is opgebouwd uit nerven en bladmoes. De kleur groen domineert, maar kan in verschillende tinten voorkomen. Soms neemt men ook tinten van herfstkleuren zoals bruin of oranje waar die het bladgroene in beperkte maten complementeerd. Waar de Hisan verschilt van de Rosan, is dat deze lang en slank zijn. Ze zijn vaak twee meter of meer, maar zeer mager volgens menselijke standaarden.\n\n## Vaardigheden\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Finesse, Wijsheid of Charisma.\n\n***Snelheid.*** 30ft\n\n***Draagcapaciteit.*** Medium\n\n***Gewichtsklasse.*** Medium\n\n***Aangeboren Talent.***  \nJe kan niet gecharmeerd worden. Eén keer per dag, als je faalt op een Wijsheid of Charisma reddingsworp, kun je kiezen om te slagen.\n\n***Aangeboren Talent.*** Je kunt één levend, intelligent wezen aanraken, en proberen één herinnering uit hun geest te lezen. Indien het wezen slaapt, slaagt de poging automatisch, anders maakt het doelwit een Wijsheidsreddingsworp tegen een DC van `8 + PB + Charisma Bonus`. Indien het wezen slaagt met 5 of meer, dan heeft deze door dat je probeerde in te dringen in zijn geest. Het wezen is immuun tegen verdere indringen voor 24 uur, ongeacht of hij faalt of succesvol is. Je kan deze vaardigheid een maximaal aantal keer per dag gebruiken gelijk aan je charisma bonus.\n\n***Cultureel Talent.*** Je mag één [generiek talent](/rules/talents) kiezen."
    },
    {
      "name": "Rosan",
      "description": "In de volksmond worden ze vaak benoemd als lage elf. Een toepasselijke naam voor het kleine schepsel, dat gewoonlijk niet veel langer is als 90cm. De Rosan tunnelt door weelderige heuvels of bouwt hutten in de toppen van bomen. Het is een volk dat zich verzameld in kleine gemeenschappen. Ze leven in rustige, afgezonderde dorpen en genieten van de kleine dingen in het leven.\n\n## Uiterlijk\n\nDe Rosan deelt veel uiterlijke kenmerken met de Hisan. Het meest opvallende is de huid. Deze heeft een bladachtige textuur, alsof het is opgebouwd uit nerven en bladmoes. De kleur groen domineert, maar kan in verschillende tinten voorkomen. Soms neemt men ook tinten van herfstkleuren zoals bruin of oranje waar die het bladgroene in beperkte maten complementeerd. Waar de Rosan verschilt van de Hisan, is hun korte gestalte. Een Rosan is gewoonlijk niet veel langer als 90cm. Soms worden ze verward met Hisankinderen, hoewel de Rosan in proporties vaak iets meer overéénkomt met de mens, en dus iets gezetter is als de Hisan.\n\n\n## Vaardigheden\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Finesse, Wijsheid of Charisma.\n\n***Snelheid.*** 7.5m (25ft)\n\n***Draagcapaciteit.*** Small\n\n***Gewichtsklasse.*** Small\n\n***Aangeboren Talent.*** Je kan een bericht met de wind meegeven dat niet langer dan 24 woorden is. Je kiest een ontvanger en locatie waar het bericht geleverd moet worden. Je bericht is een uur onderweg voor elke 20 kilometer die het aflegt, maar de afstand is onbeperkt. Indien de ontvanger aanwezig is op de locatie, kan deze een Perceptieworp maken met een DC 15 om het bericht te horen. Je kan dit hoogstens één maal per dag doen.\n\n***Aangeboren Talent.*** Je kan één levenssteen opofferen om een deel van je geest uit te ademen en een klein (Tiny) dier binnen 1.5m (5ft) van je te bezitten. Het bezeten dier wordt vriendelijk tegenover jou en volgt je commando's, zolang ze uit ongeveer 3 of minder stappen bestaan. Als het dier sterft terwijl het bezeten is, rol de levenssteen: je ontvangt het resultaat als psychische schade. Het maximum aantal dieren dat je op deze manier kan bezitten is gelijk aan je charisma bonus. Voor elk dier dat je bezit, reduceer je maximale aantal levensstenen met één. Je krijgt de steen pas terug als de bezitting is opgeheven.\n\n***Cultureel Talent.*** Je mag één [generiek talent](/rules/talents) kiezen."
    }
  ]
}