{
  "name": "Ghímach",
  "description": "___Etymologie.__ samenvoegsel van het Istrí Ghídû (ziel) en Latijns M$\\bar{a}$china (machine)_\n\t\t\nDe Ghímach is zowel een knap staaltje techniek als een gruwel om te aanschouwen. Het vindt zijn oorsprong in 2743 van de 3de telling als een poging van de Urrmagiër Zakaya om eeuwig leven te bereiken. Als men het vergankelijke vlees van onze beperkende lichamen zou kunnen verwijderen en vervangen door het metaal en de intrinsieke systemen van een magitron, zouden we eeuwig kunnen leven. Alleszins, dit was het idee.\n\t\t\t\nDe vele experimenten die deze hypothese volgde, zou men niet bepaald etisch noemen. De meeste van de proefpersonen, meestal slaven natuurlijk, overleefde de procedure niet. Sommige beweren dat men rond Ilasj Morem nog altijd de schreeuwen kan horen van de slachtoffers.\n\t\t\t\nZover we weten heeft Zakaya nooit succes in zijn onderzoek gezien. Hoewel sommige beweren dat hij zijn experiment op hemzelf heeft geprobeerd en zijn gebroken lichaam nog altijd ronddwaalt rond Ilasj Morem. Wat ook zijn lot mocht zijn, Zakaya's experimenten waren niet ter vergeefs. Door het lichaam en de ziel te combineren met de katalysatorkristalen kan men magitron ontwikkelen die niet gebonden is aan de aanwezigheid van een Aereankristal.\n\nDe ziel dient als geleider voor magie naar het katalysatorkristal, waardoor het locatie onafhankelijk de rest van het lichaam van energie kan voorzien. Organisch materiaal staat nog altijd aan de basis, de meeste Ghímach bezitten nog altijd over het originele hart en brein van de persoon waaruit ze is opgebouwd. In sommige gevallen zijn de andere organen in hun originele staat aanwezig, in andere zijn ze vervangen door machines. Meestal is het een combinatie van de twee. De rest van de Ghímach bestaat uit hout, steen of metaal (vaak koper of ijzer). Liefst maar één van de drie aangezien dit de beste resultaten geeft. Voeg wat zintuiglijke functies toe en u heeft de grootste lijnen van wat een Ghímach is. Natuurlijk komt dit met de kost dat iemand het leven zal moeten geven zodat een Ghímach hieruit gebouwd kan worden.\n\t\t\t\nMen vraagt zicht misschien af waarom men dan nog altijd Ghímach bouwt, en niet gewone magistruct. Het is waar dat de bouw van een Ghímach aanzienlijk duurder is, maar terwijl het lijkt dat sommige magistructen een bewustzijn hebben, is dit gewoonlijk niet waar. De meeste constructies hebben een gelimiteerde intelligentie en bewustzijn. De slimmere hebben gewoonlijk een zeer complexe synthetische ziel, waardoor ze nog steeds gebonden zijn aan de bevelen van hun meester en niet goed integreren met de stromen van magie. Hun magische vaardigheden moeten ingebouwd worden in deze neppe \"ziel\", wat de kost opdrijft als ze veelzijdiger worden. Alternatief hebben ze geen synthetische ziel, maar zijn ze bezeten door een geest, wat natuurlijk een héél een ander verhaal is. Het gebruik van een echte ziel geeft compleet bewustzijn en absolute veelzijdigheid.\n\t\t\t\n## Slaven van de staat\n\nWanneer iemands ziel wordt geoogst en geïmplementeerd in een Ghímach, dan vergeet deze het meeste van zijn vorige leven. Hoogstens heeft men nu en dan flashbacks of dromen van dit afgelopen hoofdstuk. Dit maakt een Ghímach niet bepaald een aantrekkelijke optie voor iemand die zijn leven wilt verlengen. Het maakt de Ghímach echter wel aantrekkelijk voor een ander doeleinde: het opofferen van de boerenstand en slaven in ruil voor een sterke werkkracht of machtige krijgers. Deze twee groepen zijn gewoonlijk vervangbaar en aangezien men na de conversie het vorige leven vergeten is en de vaardigheden uit dit leven nietig zijn, is het logisch dat men deze mensen converteert. Meestal krijgt de familie van een burger een vergoeding als deze zich laat converteren. Schooiers en slaven worden in sommige landen gedwongen geconverteerd (opgeruimd staat netjes!).\n\t\t\t\nGhímach zijn duur, dus er bestaan er niet zoveel. De meeste rijken maken dan ook optimaal gebruik van de Ghímach die ze hebben om gevaarlijk, vuil of zwaar werk op te knappen. De meeste Ghímach volgen bevelen dan ook zonder nadenken. Veel moeite wordt gestoken om ze vanaf de conversie te indoctrineren. Toch komt het soms voor dat Ghímach die het gevolg zijn van een gedwongen conversie worden gewekt door herinneringen uit het verleden. Wat leidt tot desertie en een ongewone avonturier.\n\t\t\t\n## Vaardigheden\n\n***Drijvende Energie.*** Kies één schadetype, dit is je drijvende energie: vuur (stoom), bliksem of radiatie\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Kracht, Finesse of Vitaliteit.\n\n***Snelheid.*** 7.5m (25ft)\n\n***Draagcapaciteit.*** Small of Medium\n\n***Gewichtsklasse.*** Small of Medium\n\n***Aangeboren Talent.*** Je hebt resistentie tegen je gekozen type van drijvende energie. Je mag één van de volgende integraties kiezen:\n\n- Je hebt extra bepantsering en krijgt standaard een +2 bonus op je pantserklasse\n- Je hebt één wapen of type gereedschap geïntegreerd in je lichaam. Je bent vaardig met dit wapen of gereedschap.\n- Je bent gefocust op mobiliteit, je snelheid verhoogd met <span class=\"kw-range\">3m (10ft)</span> en je kiest tussen een zwem- of klimsnelheid gelijk aan je wandelsnelheid.\n\n***Aangeboren Talent.*** Wanneer je een aanval doet, kan je er voor kiezen om je aanval te overladen met je eigen levens energie. Je offert één levenssteen en deelt <span class=\"kwd8\">1d8 extra schade</span> uit van hetzelfde type als je drijvende energie. Je aanval verandert ook in een magische aanval. Je mag kiezen om dit te doen nadat je je aanval hebt geworpen, maar voordat je schade werpt.\n\n***Cultureel Talent.*** Je mag één [generiek talent](/rules/talents) kiezen.",
  "author": "Wald Habets",
  "lineages": []
}