{
  "name": "Halfmens",
  "description": "De beestenvloek is een hogere vloek die nauw verwant is aan lycantropie. Het is één van de meest voorkomende hogere vloeken in Ittilia. De vloek geeft haar slachtoffer sterke dierlijke kenmerken, tot het punt dat men die persoon zou kunnen verwarren met een antropomorfistisch dier.\n\t\t\t\nDe vloek op zichzelf is niet bepaald schadelijk. Het slachtoffer haar persoonlijkheid verandert niet, noch verliest ze enige controle over haarzelf. Sommige van de dierlijke kenmerken kunnen zelfs voordelig zijn. Toch heeft het dierlijk uiterlijk vaak een sterke sociale impact, die in sommige instanties zelfs tot vervolging of zelfdoding kunnen lijden.\n\t\t\t\nEr zijn twee manieren waarop iemand het slachtoffer kan worden van de beestenvloek: ze wordt ermee geboren of de vloek wordt later op haar gedwongen. Een kind wordt natuurlijk geboren met de vloek, wanneer zij gebaard wordt door een lycantroop die in haar dierlijke of half-dierlijke vorm is, en niet onder het effect van een volle maan is.\n\t\t\t\nDe reden waarom de vloek zo vaak voorkomt is echter omdat ze zo gemakkelijk te repliceren is. Alles wat men nodig heeft is het hart van het dier waarin men het slachtoffer wilt veranderen, een beker bloed van een lycantroop, Feayor die vol is en de juiste betoverende woorden. Het resultaat levert één dosis van een magisch brouwsel, dat wanneer iemand het volledig inneemt, het haar vervloekt met de beestenvloek.\n\t\t\t\nHoewel de vloek schadeloos is voor de rest van de samenleving, is er vaak toch veel wantrouwen en zelfs haat tegen de slachtoffers. Dit heeft alles te maken met het feit dat deze slachtoffers vaak kinderen van lycantropen zijn, wat leidt tot vele negatieve vooroordelen. Sommige gemeenschappen begrijpen de ware aard van de vloek goed, en hier verwelkomen ze slachtoffers ervan zoals ze elke andere persoon zouden verwelkomen. Echter in andere gemeenschappen worden deze personen opgejaagd of verbannen. Meestal ligt de reactie ergens tussenin, slachtoffers worden gezien als een monsterlijkheid, een merkwaardigheid, een punt van nieuwsgierigheid. Ze worden nagekeken of nagewezen, soms lastig gevallen, andere keren ontweken en zeer vaak teruggevonden in een circus.\n\n## Vaardigheden\n\n***Sjabloondier.*** Veel van je eigenschappen hangen af van het sjabloondier van je vloek. Wanneer je deze soort kiest, kies je een sjabloondier, dit kan elk normaal dier zijn. (Dus bijvoorbeeld niet reuze dieren, zwermen, dinosaurussen, dieren die een harnas dragen, ...)\n\n***Attribuut.*** Je ontvangt een +1 in het hoogste attribuut van je sjabloondier. Als meerdere attributen de hoogste score delen, dan mag je kiezen voor welk attribuut je de +1 ontvangt.\n\n***Snelheid.*** 9m (30ft)\n\n***Draagcapaciteit.*** Medium\n\n***Gewichtsklasse.*** Medium\n\n\nJe natuurlijke talenten hangen af van je gekozen sjabloondier. Als je voor geen één talent in aanmerking komt bij één van de categorieën, overleg met je spelmeester.\n\t\t\t\n***Aangeboren Talent.*** Je kiest één van de drie ongewapende aanvallen en je bent bekwaam met deze aanval. Je gebruikt je sjabloondier's primaire vaardigheid voor deze aanval.\n- **Klauwen.** `1d4` Slashing schade. _Enkel mogelijk als je sjabloondier \"claw\" of \"talon\" als actie heeft._\n- **Bijten.** `1d4` Piercing schade. _Enkel mogelijk als je sjabloondier \"bite\", \"beak\" of \"tusks\" als actie heeft._\n- **Slaan.** `1d4` Bludeoning schade. _Enkel mogelijk als je sjabloondier \"Fist\", \"Hooves\", \"Tentacles\" of \"Tail\" als actie heeft._\n\n\t\t\t\t\n***Aangeboren Talent.*** Kies één van de volgende passieve vaardigheden.\n\n- **Snel.** Je bewegingssnelheid is 12m (40ft) _Enkel mogelijk als de bewegingssnelheid van je sjabloondier hoger dan 9m (30ft) is._\n- **Natuurlijk Pantser.** Je krijgt een +1 bonus op je pantser. (Dit kan zich voortdoen als dikke huid, schubben, stekels, ...) _Enkel mogelijk als je sjabloondier \"Natuurlijk Pantser\"\\ heeft._\n- **Water Affiniteit.** Je kan je adem inhouden voor 15 minuten en hebt een zwemsnelheid gelijk aan je bewegingssnelheid. _Enkel mogelijk als je sjabloondier \"Hold Breath\", \"Waterbreathing\" of \"Amphibious\" heeft._\n - **Lastdier.** Je hebt de draagcapaciteit van één grootteklasse hoger. _Enkel als je sjabloondier \"Beast of Burden\" heeft._\n-  **Imitatie.** Je kan perfect de stem imiteren van een wezen dat je eerder hebt horen praten.\n\t\t\t\n***Aangeboren Talent.*** Je kiest één vaardigheid die je per dag een aantal keren gelijk aan je vaardigheidsbonus kan uitvoeren.\n\n- **Verhoogde zintuigen.** Je kan ervoor kiezen om extra +10 bonus toe te voegen aan een Perceptie. _Enkel mogelijk als je sjabloondier \"Keen Smell\", \"Keen Hearing\" of \"Keen Sight\" heeft._\n- **Camoeflage.** Je kan ervoor kiezen om extra +10 bonus toe te voegen aan een Sluip. _Enkel mogelijk als je sjabloondier \"Shell Camouflage\", \"Camoeflage\" of \"Underwater Camoeflage\" heeft._\n- **Lange Sprong.** Je kan 1.5m (5ft) extra toevoegen aan een sprong (met aanloop of vanuit stilstand) voor elk punt dat je hebt in je vaardigheidsbonus. _Enkel mogelijk als je sjabloondier \"Vliegsnelheid\" of \"Standing Leap\" heeft._\n\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen.",
  "author": "Wald Habets",
  "lineages": []
}