{
  "name": "Urr",
  "description": "Geboren uit de diepste krochten van Ittilia is de oudste dominante soort. Een strategische geest en indrukwekkend vermogen om te organiseren maak Urran de meest succesvolle bloedlijn in Ittilia. Hun architecten creëerden bouwwerken en steden zoals geen ander in de wereld. Onvoorstelbaar in grootsheid en onverwoestbaar, zelfs voor de machtigste wezens. Hun ambachtslieden baren handwerken van legendarische kwaliteit. Het staal gesmeden door de Urr zal zijn drager zelden falen. De Urr zou de wereld bedekken met het rook en vuur van zijn machtige industrie.\n\nMeermaals hebben de Urran geprobeerd om de Yxothri van hun troon te stoten. Iedere keer opnieuw faalde ze. Dol'Gher is nog altijd een litteken op het oppervlak van Ittilia, het gevolg van één van de oorlogen tegen de Yxothri. Niet te min is de Urr de machtigste van de dominante soorten op Ittilia. Hun vakmanschap is niet afgenomen. Lijdend aan een onlesbare dorst naar kennis en macht.\n\nMen kan gewoonlijk drie bloedlijnen waarnemen onder de Urran. Elke bloedlijn kent vele onderrassen, maar deze zullen we hier niet bespreken. De onderrassen binnen een bloedlijn kennen gewoonlijk geen speciale eigenschappen, behalve esthetische verschillen. Voortplanting tussen de drie rassen resulteert in een kind van één rassen. Gewoonlijk wordt dit bepaald door de moeder, maar in zeldzame gevallen erft het kind het ras van de vader. De drie rassen die we kennen zijn Aardling, Goliat en Mens.",
  "author": "Wald Habets",
  "lineages": [
    {
      "name": "Aardling",
      "description": "De aardling staat in contrast met de andere Urr bloedlijnen, zowel op vlak van uiterlijk als cultuur. Ze leven diep onder de aardkorst, weg van het daglicht. Een mens of goliat zou hier depressief van worden, maar de aardling voelt zich thuis in vochtige stenen tunnels. Dit wilt niet zeggen dat ze een afgezonderd volk zijn, in berggebieden leven ze vaak in harmonie met de mensen of goliats. Zelfs in de vlaktes vind met soms een kleine aardlingen gemeenschap onder steden. Niettemin verkiezen ze hun woonst ondergrond, diep ondergrond.\n\n## Uiterlijk\n\nEen aardling is zeer gelijkaardig aan een mens in uiterlijk. Hun huid is echter griezelig bleek en doet denken aan een wandelend lijk. Dit is echter te verwachten voor een wezen dat het grootste deel van hun leven uit het zonlicht leeft. Ze staat ook iets lager. Gemiddeld is de aardling niet veel langer dan 1m60. De meest uniek eigenschap is echter de ledematen van de aardling. Hun onderarmen en benen zijn bedekt met een natuurlijk, ijzer scleriet, niet ongelijk de [Chrysomallon squamiferum](https://en.wikipedia.org/wiki/Scaly-foot_gastropod#Shell). De zwart-grijze kleur ervan is in sterk contrast met hun huid en dankt zijn kleur aan ijzerertsen. Dit pantser verspreidt zich verder tot de handen en voeten en mondt uit in harde klauwen. Het is niet hard genoeg om significante bescherming te bieden tegen conventionele aanvallen, maar stelt de aardling wel in staat om door verschillende gesteenten te graven. De screliet vorming komt bij vele aardlingen ook voor rond de ruggenwervel en het borstbeen.\n\n\n## Weetjes\n\n* De aardling krijgt de meerderheid van zijn ijzer uit de paddenstoelen die ze kweken op ijzeraders. In sommige gevallen vullen ze hun voeding aan met gemalen ijzerertsen.\n* Je kan een aardling gebruiken als magneetbord.\n* Aardling tatoeages bestaan gewoonlijk niet uit inkt, maar worden gekrast in hun sclerieten.\n\n\n## Vaardigheden\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Kracht, Vitaliteit of Intelligentie.\n\n***Snelheid.*** 7.5m (25ft), 1.5m (5ft) burrow\n\n***Draagcapaciteit.*** Medium\n\n***Gewichtsklasse.*** Medium\n\n***Aangeboren Talent.*** Je hebt _duisterzicht_. Je voor 18m (60ft) in schemerlicht zien alsof het helder licht is, en voor 18m (60ft) in duisternis alsof het schemerlicht is.\n\n***Aangeboren Talent.*** Je hebt de natuurlijke vaardigheid om met je klauwen door zelfs het hardste gesteente te graven. Voor elk half uur dat je graaft, gooi een d20 en tel je mod(Kracht) hierbij op. Als je hoger gooit dat de pantserklasse van het gesteente, dan heb je 1.5m voortgang gemaakt. Je maakt de volledige voortgang, of geen, niets tussenliggend. Het graven maakt geluid dat mogelijks hoorbaar is voor nabije wezens.\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen."
    },
    {
      "name": "Goliat",
      "description": "De goliats zijn krachtige wezens die meeste rassen fysiek gezien vaak niet kunnen evenaren. Ze vormen desondanks slechts een klein deel van de Urr gemeenschappen. Niet dat dit veel uitmaakt: goliats en mensen zijn diep met elkaar verweven. Ze vormen één gemeenschap en cultureel zijn er weinig verschillen. De goliat zijn kracht maakt de menselijke gebreken goed en men ziet dit volk dan ook vaak het zware fysieke werk uitvoeren. Dit wilt niet zeggen dat men een goliat nooit een hoge politieke of academische functie ziet beklimmen, maar gewoonlijk wordt deze plaats gereserveerd door zijn slimmere menselijke neef.\n\n## Uiterlijk\n\nGoliats zijn omvangrijke wezens. Hun gemiddelde lengte schommelt rond de twee meter. De meerderheid van hun omvang komt echter niet van hun lengte, maar hun breedte: brede schouders en dikke armen. Fysiek gezien zeer krachtige wezens. Ze hebben echter een verbazend korte nek: naar achter kijken kan nog wel eens moeilijk zijn. De goliat valt op tussen een massa mensen omwille van zijn omvang. Dit durft wel eens een probleem te vormen op het openbaar vervoer: wanneer deze het merendeel van de kar in beslag neemt, of 2 plaatsen in een overvolle treinwagon.\n\n## Vaardigheden\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Kracht, Vitaliteit of Charisma.\n\n***Snelheid.*** 9m (30ft)\n\n***Draagcapaciteit.*** Large\n\n***Gewichtsklasse.*** Medium\n\n***Aangeboren Talent.*** Telkens wanneer je een rang omhoog gaat, ontvang je 2 extra levenspunten bovenop je normale toename.\n\n***Aangeboren Talent.*** Je hebt ontzettende weerbaarheid. Je kan één levenssteen opofferen om een bonus te verkrijgen op een Kracht-, Finesse- of Vitaliteitsreddingsworp. Voor elke steen die je opoffert mag je `1d6` toevoegen aan je reddingsworp.\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen."
    },
    {
      "name": "Mens",
      "description": "De mens is niet alleen de meest succesvolle Urr, maar ook de meest succesvolle bloedlijn in het algemeen. Dit danken ze aan het feit dat ze zelfs binnen de Urran een ongelooflijke flexibiliteit en intelligentie vertonen. Ze maken zich thuis in praktisch elk gebied.\n\n## Uiterlijk\n\n|![De mens](https://commons.wikimedia.org/wiki/File:Make-up_mirror.jpg)|\n|---|\n|Afbeelding van een mens|\n\n\n## Vaardigheden\n\n***Attribuut.*** Verhoog één van de volgende attributen met 1 punt: Vitaliteit, Intelligentie of Charisma.\n\n***Snelheid.*** 9m (30ft)\n\n***Draagcapaciteit.*** Medium\n\n***Gewichtsklasse.*** Medium\n\n***Aangeboren Talent.*** Aan het begin van je dag, rol een d10. Als je een 1 gooit ontvang je één punt van Inspiratie.\n\n***Aangeboren Talent.*** Telkens wanneer je faalt op een vaardigheidsworp, ontvang je één punt van Motivatie, tot een maximum van 5. Je kan ervoor kiezen om deze punten in te zetten om een bonussteen toe te voegen aan een vaardigheidsworp. De bonussteen hangt af van je aantal punten Motivatie: 1. d4, 2. d6, 3. d8, 4. d10 en 5. d12. Je mag er voor kiezen om dit toe te passen na je initiële worp, maar voor het resultaat ervan bekend is.\n\n***Cultureel Talent.*** Je mag één generiek talent kiezen."
    }
  ]
}